# Проектная деятельность
# Анализ желаний пользователя
# 1 комфорт
# 2 Расширение сферы влияния
# 3 Долгая здоровая жизнь

# 1 нужно углубиться в тему и проанализировать
# Энергетика это многокомпонентная отрасль !!!
# 1 Что вы собираетесь делать? Целевая аудитория.
# 2 Зачем, это делать? (Проанализировать проблему отрасли, объекта и т.д)
# 3 Когда ваша разработка будет полезна ?
# 4 Где будет использоваться ? (изучить все сферы применения вашего проекта)
# 5 Сколько будет стоить проект? (Экономический анализ - окупаемость,
# стоймость разработки, дополнительные расходы на содержания и работу проекта, конечную стоймость продукта)
# Презентация
# Код или решение
# Документацию (объясняла как работает решение)
# Команда до 3х человек