#Операторы
# data = "1"
# операнды - структуры над которыми выполняется операция
# операторы арифметические - " +, -, *, /, **, //, %,"
# Операторы сравнения - ">,<, <=, >=, ==, !="
# Оператор приравнивания - =
#+=, -=, /=, *= - Суммируют значение с обоих сторон и присваивают значение выражению с лева

# Логические операторы - and
# utils = 7 == 7 and 2 > -1
# print(utils)
# если оба условия истинны то вернется True

# or
# utils = utils = (0)
# print(utils)
# Если хотя бы одно из условий истина - то вернётся True

# not
# utils = 7 == 7 and 2 > -1
# # переворачивает значение True/false
# print(not(utils))

# Оператор принадлежности in - проверяет нет ли последовательности в списке
# pets = ['dog','cat', 'perrot']
# print('fish' in pets)

#not in - проверяет НЕ является ли объект частью последовательности
# pets = ['dog','cat', 'perrot']
# print('fish' not in pets)

# операторы тождественности is
# проверка на одинаковую принадлежность типов данных
# utils ='2' is "2"
# print(utils)

# is not
# utils ='2' is not "2"
# print(utils)

# Битовые операторы
# Бинарное "и" - & (and)
# utils = 3&4 # 10&11
# print(utils)

# бинарное или - "|(or)"
# utils = 2|3
# print(utils)

# инвертирующий оператор - " ~ "
# 00000010
# 11111101
# print(~-3)

#<< - бинарный сдвиг влево
#>> - бинарный сдвиг вправо
# print(3>>2)#00
# print(3>>1)#01

